{
  "toolbar-gpio.description": "8 GPIOs on CPX! Pin A1 - A7 can also be used as capacitive touch sensors, and A0 is a true analog output pin.",
  "toolbar-gpio.title": "GPIO",
  "toolbar-gpio.tryItDescription": "Use your mouse to interact with the pin A1 - A7 or use your keyboard SHIFT+”1” - “7”",
  "toolbar-ir-sensor.description": "Allows you to send commands to the CPX with a remote control, or even send messages between multiple CPXs! You can also do very simple proximity sensing since it reads the reflected light.",
  "toolbar-ir-sensor.title": "IR Transmit & Receiver",
  "toolbar-ir-sensor.tryItDescription": "We’re working hard to support this sensor on the simulator in the Pacifica. You can try it on MakeCode!",
  "toolbar-ir-sensor.tryItTitle": "We’re working hard to support this sensor on the simulator in the Pacifica. You can try it on MakeCode!",
  "toolbar-light-sensor.description": "An analog light sensor can be used to detect ambient light, with similar spectral response to the human eye.",
  "toolbar-light-sensor.title": "Light Sensor",
  "toolbar-light-sensor.tryItDescription": "Change the brightness from 0 - 255 here!",
  "toolbar-motion-sensor.description": "Detects acceleration in XYZ orientations. And can also detect 'tap' and 'double tap' strikes on the board and when the board is shaken.",
  "toolbar-motion-sensor.title": "Motion Sensor",
  "toolbar-motion-sensor.tryItDescription": "Change the acceleration here and click or click on the button to simulate a shake.The tap feature is not supported by pacifica. You can try it on MakeCode!",
  "toolbar-neo-pixels.description": "The 10 full color RGB LEDs surrounding the outer edge of the boards can be set to any color. Great for beautiful lighting effects!",
  "toolbar-neo-pixels.title": "NeoPixels",
  "toolbar-neo-pixels.tryItDescription": "Run your code and see the cool effects on the simulator!",
  "toolbar-push-button.description": "Two push buttons A and B are connected to digital pin #4 (Left) and #5 (Right) each.",
  "toolbar-push-button.title": "Push Buttons",
  "toolbar-push-button.tryItDescription": "Click them with your mouse or by pressing “A” “B” on your keyboard!",
  "toolbar-red-led.description": "This Red LED is connected to the digital #13 GPIO pin. It can be very handy when you want an indicator LED.",
  "toolbar-red-led.title": "Red LED",
  "toolbar-red-led.tryItDescription": "Run your code and see the cool effects on the simulator!",
  "toolbar-sound-sensor.description": "A digital microphone can detect audio volume and even perform basic FFT functions but cannot read it like an analog voltage.",
  "toolbar-sound-sensor.title": "Sound Sensor",
  "toolbar-sound-sensor.tryItDescription": "We’re working hard to support this sensor on the simulator in the Pacifica. You can try it on MakeCode!",
  "toolbar-slider-switch.description": "This slide switch returns True or False depending on whether it's ON or OFF and can be used as a toggle switch in your code!",
  "toolbar-slider-switch.title": "Slider Switch",
  "toolbar-slider-switch.tryItDescription": "Click it with your mouse to switch it ON and OFF!",
  "toolbar-speaker.description": "This speaker can play .wav file and different tones and also has a class D amplifier that is connected to an output A0 pin built in! You can turn it off using the shutdown control on pin #11 on the physical device.",
  "toolbar-speaker.title": "Speaker",
  "toolbar-speaker.tryItDescription": "Run your code and you’ll hear the music!",
  "toolbar-temperature-sensor.description": "This sensor uses an NTC thermistor to sense temperature an calculate it with the analog voltage on analog pin #A9.",
  "toolbar-temperature-sensor.title": "Temperature Sensor",
  "toolbar-temperature-sensor.tryItDescription": "You can set the temperature range from your code!"
}
